Spectrewolf777/Stm32l4-Watch/Core/Inc/lsm6dsv16x_reg.h
/* Temperature data format in FIFO */
typedef struct
{
  uint16_t temperature;
} lsm6dsv16x_fifo_temperature;

/* Timestamp  format in FIFO */
typedef struct
{
  uint32_t timestamp;
} lsm6dsv16x_fifo_timestamp;

/* Step counter data format in FIFO */
typedef struct
{
  uint16_t steps;
  uint32_t timestamp;
} lsm6dsv16x_fifo_step_counter;

typedef enum
{
  LSM6DSV16X_FIFO_EMPTY                    = 0x0,
  LSM6DSV16X_GY_NC_TAG                     = 0x1,
  LSM6DSV16X_XL_NC_TAG                     = 0x2,
  LSM6DSV16X_TEMPERATURE_TAG               = 0x3,
  LSM6DSV16X_TIMESTAMP_TAG                 = 0x4,
  LSM6DSV16X_CFG_CHANGE_TAG                = 0x5,
  LSM6DSV16X_XL_NC_T_2_TAG                 = 0x6,
  LSM6DSV16X_XL_NC_T_1_TAG                 = 0x7,
  LSM6DSV16X_XL_2XC_TAG                    = 0x8,
  LSM6DSV16X_XL_3XC_TAG                    = 0x9,
  LSM6DSV16X_GY_NC_T_2_TAG                 = 0xA,
  LSM6DSV16X_GY_NC_T_1_TAG                 = 0xB,
  LSM6DSV16X_GY_2XC_TAG                    = 0xC,
  LSM6DSV16X_GY_3XC_TAG                    = 0xD,
  LSM6DSV16X_SENSORHUB_SLAVE0_TAG          = 0xE,
  LSM6DSV16X_SENSORHUB_SLAVE1_TAG          = 0xF,
  LSM6DSV16X_SENSORHUB_SLAVE2_TAG          = 0x10,
  LSM6DSV16X_SENSORHUB_SLAVE3_TAG          = 0x11,
  LSM6DSV16X_STEP_COUNTER_TAG              = 0x12,
  LSM6DSV16X_SFLP_GAME_ROTATION_VECTOR_TAG = 0x13,
  LSM6DSV16X_SFLP_GYROSCOPE_BIAS_TAG       = 0x16,
  LSM6DSV16X_SFLP_GRAVITY_VECTOR_TAG       = 0x17,
  LSM6DSV16X_SENSORHUB_NACK_TAG            = 0x19,
  LSM6DSV16X_MLC_RESULT_TAG                = 0x1A,
  LSM6DSV16X_MLC_FILTER                    = 0x1B,
  LSM6DSV16X_MLC_FEATURE                   = 0x1C,
  LSM6DSV16X_XL_DUAL_CORE                  = 0x1D,
  LSM6DSV16X_GY_ENHANCED_EIS               = 0x1E,
} lsm6dsv16x_fifo_tag;

typedef struct
{
  uint8_t tag  : 5;
  uint8_t cnt  : 2;
  uint8_t rsvd : 1;
  uint8_t data[6];
} lsm6dsv16x_fifo_out_raw_t;

/**
  * @brief  FIFO data output[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      lsm6dsv16x_fifo_out_raw_t
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv16x_fifo_out_raw_get(const stmdev_ctx_t *ctx,
                                    lsm6dsv16x_fifo_out_raw_t *val);

/**
  * @brief  Batching in FIFO buffer of step counter value.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Batching in FIFO buffer of step counter value.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv16x_fifo_stpcnt_batch_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
  * @brief  Batching in FIFO buffer of step counter value.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Batching in FIFO buffer of step counter value.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv16x_fifo_stpcnt_batch_get(const stmdev_ctx_t *ctx, uint8_t *val);

/**
  * @brief  Batching in FIFO buffer of machine learning core results.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Batching in FIFO buffer of machine learning core results.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv16x_fifo_mlc_batch_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
  * @brief  Batching in FIFO buffer of machine learning core results.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Batching in FIFO buffer of machine learning core results.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv16x_fifo_mlc_batch_get(const stmdev_ctx_t *ctx, uint8_t *val);

/**
  * @brief  Enables batching in FIFO buffer of machine learning core filters and features.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Enables batching in FIFO buffer of machine learning core filters and features.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv16x_fifo_mlc_filt_batch_set(const stmdev_ctx_t *ctx, uint8_t val);

/**
  * @brief  Enables batching in FIFO buffer of machine learning core filters and features.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Enables batching in FIFO buffer of machine learning core filters and features.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv16x_fifo_mlc_filt_batch_get(const stmdev_ctx_t *ctx, uint8_t *val);

/**
  * @brief  Enable FIFO data batching of slave idx.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Enable FIFO data batching of slave idx.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv16x_fifo_sh_batch_slave_set(const stmdev_ctx_t *ctx, uint8_t idx, uint8_t val);

/**
  * @brief  Enable FIFO data batching of slave idx.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Enable FIFO data batching of slave idx.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv16x_fifo_sh_batch_slave_get(const stmdev_ctx_t *ctx, uint8_t idx, uint8_t *val);

typedef struct
{
  uint8_t game_rotation        : 1;
  uint8_t gravity              : 1;
  uint8_t gbias                : 1;
} lsm6dsv16x_fifo_sflp_raw_t;

/**
  * @brief  Batching in FIFO buffer of SFLP.[set]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Batching in FIFO buffer of SFLP values.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv16x_fifo_sflp_batch_set(const stmdev_ctx_t *ctx,
                                       lsm6dsv16x_fifo_sflp_raw_t val);

/**
  * @brief  Batching in FIFO buffer of SFLP.[get]
  *
  * @param  ctx      read / write interface definitions
  * @param  val      Batching in FIFO buffer of SFLP values.
  * @retval          interface status (MANDATORY: return 0 -> no Error)
  *
  */
int32_t lsm6dsv16x_fifo_sflp_batch_get(const stmdev_ctx_t *ctx,
                                       lsm6dsv16x_fifo_sflp_raw_t *val);


/**
  * @}
  *
  */

/**
  * @defgroup  Filters Filter Configuration
  * @brief     This section group all the functions concerning the
  *            filters configuration
  * @{
  *
  */

